Table of Contents
 Class ProjectDataConcreteEc2
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Project data concrete Ec2
[OpenModelClass("CI.Services.Concrete.Ec2.ProjectDataConcreteEc2,CI.ProjectData", "CI.Services.Concrete.IProjectDataConcrete,CI.BasicTypes", typeof(ProjectDataConcrete))]
public class ProjectDataConcreteEc2 : ProjectDataConcrete
Inheritance
object
OpenObject
ProjectDataConcrete
ProjectDataConcreteEc2
Inherited Members
 ProjectDataConcrete.DesignWorkingLife
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ProjectDataConcreteEc2()
Constructor
public ProjectDataConcreteEc2()
Properties
 CodeEN1992_2
Flag if code EN 1992-2 is included
public bool CodeEN1992_2 { get; set; }
Property Value
bool
 CodeEN1992_3
Flag if code EN 1992-2 is included
public bool CodeEN1992_3 { get; set; }
Property Value
bool
 Edit this page